; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	thermograph1 - mode
	infrared2 - mode
	image4 - mode
	spectrograph5 - mode
	infrared3 - mode
	GroundStation3 - direction
	Star4 - direction
	Star1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared2)
	(supports instrument0 image4)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 infrared2)
	(supports instrument2 image4)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image4)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Planet15)
	(have_image Star5 thermograph1)
	(have_image Star5 infrared3)
	(have_image Star6 infrared0)
	(have_image Star6 infrared3)
	(have_image Star7 image4)
	(have_image Star8 infrared3)
	(have_image Star8 infrared0)
	(have_image Star9 infrared3)
	(have_image Star9 infrared2)
	(have_image Star10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Star11 image4)
	(have_image Phenomenon12 spectrograph5)
	(have_image Phenomenon12 infrared3)
	(have_image Phenomenon13 thermograph1)
	(have_image Star14 infrared2)
	(have_image Star14 spectrograph5)
	(have_image Planet15 infrared3)
))

)

; plan
1. (turn_to satellite1 star1 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star1)
   goals met: 0 of 19
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 19
3. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 19
4. (turn_to satellite1 star9 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star9)
   goals met: 0 of 19
5. (take_image satellite1 star9 instrument2 infrared2)
   added: (have_image star9 infrared2)
   goals met: 1 of 19
6. (turn_to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 1 of 19
7. (take_image satellite1 star7 instrument2 image4)
   added: (have_image star7 image4)
   goals met: 2 of 19
8. (turn_to satellite1 star14 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star14)
   goals met: 2 of 19
9. (take_image satellite1 star14 instrument2 spectrograph5)
   added: (have_image star14 spectrograph5)
   goals met: 3 of 19
10. (take_image satellite1 star14 instrument2 infrared2)
   added: (have_image star14 infrared2)
   goals met: 4 of 19
11. (turn_to satellite1 star11 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star11)
   goals met: 4 of 19
12. (take_image satellite1 star11 instrument2 image4)
   added: (have_image star11 image4)
   goals met: 5 of 19
13. (turn_to satellite1 phenomenon12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon12)
   goals met: 5 of 19
14. (take_image satellite1 phenomenon12 instrument2 spectrograph5)
   added: (have_image phenomenon12 spectrograph5)
   goals met: 6 of 19
15. (turn_to satellite1 groundstation0 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 groundstation0)
   goals met: 6 of 19
16. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 6 of 19
17. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 19
18. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 6 of 19
19. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 6 of 19
20. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 6 of 19
21. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 6 of 19
22. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 6 of 19
23. (take_image satellite0 phenomenon12 instrument1 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 7 of 19
24. (turn_to satellite0 star5 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star5)
   goals met: 7 of 19
25. (take_image satellite0 star5 instrument1 infrared3)
   added: (have_image star5 infrared3)
   goals met: 8 of 19
26. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 8 of 19
27. (take_image satellite0 star6 instrument1 infrared0)
   added: (have_image star6 infrared0)
   goals met: 9 of 19
28. (take_image satellite0 star6 instrument1 infrared3)
   added: (have_image star6 infrared3)
   goals met: 10 of 19
29. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 10 of 19
30. (take_image satellite0 star8 instrument1 infrared0)
   added: (have_image star8 infrared0)
   goals met: 11 of 19
31. (take_image satellite0 star8 instrument1 infrared3)
   added: (have_image star8 infrared3)
   goals met: 12 of 19
32. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 12 of 19
33. (take_image satellite0 star9 instrument1 infrared3)
   added: (have_image star9 infrared3)
   goals met: 13 of 19
34. (turn_to satellite0 planet15 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet15)
   goals met: 14 of 19
35. (take_image satellite0 planet15 instrument1 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 15 of 19
36. (turn_to satellite1 phenomenon13 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon13)
   goals met: 15 of 19
37. (take_image satellite1 phenomenon13 instrument3 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 16 of 19
38. (turn_to satellite1 star10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star10)
   goals met: 16 of 19
39. (take_image satellite1 star10 instrument3 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 17 of 19
40. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 17 of 19
41. (take_image satellite1 star11 instrument3 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 18 of 19
42. (turn_to satellite1 star5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star5)
   goals met: 18 of 19
43. (take_image satellite1 star5 instrument3 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 19 of 19
